app/Controllers/Profile.php

SELECT *
FROM `users`
 LIMIT 1
---
    public function index()
    {
        $data['user'] = (new UserModel())->first();