app/Controllers/Tasks.php

    public function index()
    {
        $data['tasks'] = (new TaskModel())->orderBy('task_date', 'ASC')->findAll();
---
SELECT *
FROM `tasks`
ORDER BY `task_date` ASC