app/Models/TaskModel.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-24'
---
    public function getTasksForToday()
    {
        return $this->where('task_date', date('Y-m-d'))->findAll();